src/Reports/ОтчетПоПроектнымЛинейкам/ОтчетПоПроектнымЛинейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоПроектнымЛинейкам</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/AccumulationRegisters/ПланыВыпуска/ПланыВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланыВыпуска</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутнаяКарта</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Reports/ОтчетПоПроектнымЛинейкам/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапка = Макет.ПолучитьОбласть("Шапка");
ОблНоменклатура = Макет.ПолучитьОбласть("Номенклатура");
ОблКонец = Макет.ПолучитьОбласть("Конец");

	Если ВыводитьМТК = 1 Тогда					
	ВыводМТК = "Все МТК";
	ИначеЕсли ВыводитьМТК = 2 Тогда					
	ВыводМТК = "Только выпущенные МТК";
	ИначеЕсли ВыводитьМТК = 3 Тогда					
	ВыводМТК = "Только невыпущенные МТК";
	КонецЕсли;

ОблШапка.Параметры.ВыводМТК = ВыводМТК;
ОблШапка.Параметры.ДатаНач = Отчет.Период.ДатаНачала;
ОблШапка.Параметры.ДатаКон = Отчет.Период.ДатаОкончания;
ТабДок.Вывести(ОблШапка);

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта,
	|	ПланыВыпускаОстаткиИОбороты.КоличествоКонечныйОстаток,
	|	ПланыВыпускаОстаткиИОбороты.Номенклатура,
	|	ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Линейка КАК Линейка,
	|	ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Проект КАК Проект,
	|	ПланыВыпускаОстаткиИОбороты.КоличествоПриход,
	|	ПланыВыпускаОстаткиИОбороты.КоличествоРасход
	|ИЗ
	|	РегистрНакопления.ПланыВыпуска.ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , ) КАК ПланыВыпускаОстаткиИОбороты
	|ГДЕ
	|	ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Линейка.Проектная = ИСТИНА";
	Если СписокЛинеек.Количество() > 0 Тогда
	Запрос.Текст = Запрос.Текст + " И ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Линейка В(&СписокЛинеек)";
	Запрос.УстановитьПараметр("СписокЛинеек",СписокЛинеек);
	КонецЕсли;
		Если СписокПроектов.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Проект В(&СписокПроектов)";
		Запрос.УстановитьПараметр("СписокПроектов",СписокПроектов);
		КонецЕсли; 
			Если СписокГруппНоменклатуры.Количество() > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И ПланыВыпускаОстаткиИОбороты.МаршрутнаяКарта.Проект В ИЕРАРХИИ(&СписокГруппНоменклатуры)";
			Запрос.УстановитьПараметр("СписокГруппНоменклатуры",СписокГруппНоменклатуры);
			КонецЕсли; 
				Если ВыводитьМТК = 2 Тогда					
				Запрос.Текст = Запрос.Текст + " И ПланыВыпускаОстаткиИОбороты.КоличествоКонечныйОстаток = 0";
				ИначеЕсли ВыводитьМТК = 3 Тогда					
				Запрос.Текст = Запрос.Текст + " И ПланыВыпускаОстаткиИОбороты.КоличествоКонечныйОстаток > 0";
				КонецЕсли; 
					Если СортироватьПо = 1 Тогда
					Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Линейка";
					ИначеЕсли СортироватьПо = 2 Тогда
					Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Проект";
					ИначеЕсли СортироватьПо = 3 Тогда
					Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Номенклатура";
					КонецЕсли; 
Запрос.УстановитьПараметр("ДатаНач",НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон",КонецДня(Отчет.Период.ДатаОкончания)); 
КолВсего = 0;
КолВыпВсего = 0;
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	ОблНоменклатура.Параметры.Линейка = ВыборкаДетальныеЗаписи.Линейка;
	Статус = ВыборкаДетальныеЗаписи.МаршрутнаяКарта.Статус;
		Если Статус = 0 Тогда
		Статус = "Ожидание";
		ИначеЕсли Статус = 1 Тогда
		Статус = "В работе";
		ИначеЕсли Статус = 2 Тогда
		Статус = "Остановлена";
		ИначеЕсли Статус = 3 Тогда
		Статус = "Завершена";
		КонецЕсли; 
	ОблНоменклатура.Параметры.Статус = Статус;
	ОблНоменклатура.Параметры.НомерМТК = ВыборкаДетальныеЗаписи.МаршрутнаяКарта.Номер;
	ОблНоменклатура.Параметры.МТК = ВыборкаДетальныеЗаписи.МаршрутнаяКарта;
	ОблНоменклатура.Параметры.Наимен = СокрЛП(ВыборкаДетальныеЗаписи.Номенклатура.Наименование);
	ОблНоменклатура.Параметры.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
	ОблНоменклатура.Параметры.НомерПроекта = ВыборкаДетальныеЗаписи.Проект.Наименование;
	ОблНоменклатура.Параметры.КодПроекта = ВыборкаДетальныеЗаписи.Проект.Код;
	ОблНоменклатура.Параметры.Проект = ВыборкаДетальныеЗаписи.Проект;
	ОблНоменклатура.Параметры.Кол = ВыборкаДетальныеЗаписи.МаршрутнаяКарта.Количество;
	ОблНоменклатура.Параметры.КолВып = ВыборкаДетальныеЗаписи.МаршрутнаяКарта.Количество - ВыборкаДетальныеЗаписи.КоличествоКонечныйОстаток;
	ТабДок.Вывести(ОблНоменклатура);
	КолВсего = КолВсего + ВыборкаДетальныеЗаписи.МаршрутнаяКарта.Количество;
	КолВыпВсего = КолВыпВсего + (ВыборкаДетальныеЗаписи.МаршрутнаяКарта.Количество - ВыборкаДетальныеЗаписи.КоличествоКонечныйОстаток);
	КонецЦикла;
ОблКонец.Параметры.КолВсего = КолВсего;
ОблКонец.Параметры.КолВыпВсего = КолВыпВсего;
ТабДок.Вывести(ОблКонец);
ТабДок.ФиксацияСверху = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
СформироватьНаСервере();
КонецПроцедуры
